In [57]:
import numpy
import pandas as pd
import sqlite3 as lite

In [58]:
EmpId=['E101','E102','E103','E104']
FName=['Shweta','Manisha','Madhu','Anita']
LName=['Subnis','Perdesi','Mali','Rai']
Designation=['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
BasicSalary=[40000,50000,60000,70000]
EmpData=zip(EmpId,FName,LName,Designation,BasicSalary)
df=pd.DataFrame(data=EmpData,columns=['EmpId','FName','LName','Designation','BasicSalary'])
df

  EmpId    FName    LName         Designation  BasicSalary
0  E101   Shweta   Subnis     ProjectEngineer        40000
1  E102  Manisha  Perdesi              Tester        50000
2  E103    Madhu     Mali  SrSoftwareEngineer        60000
3  E104    Anita      Rai        WebDeveloper        70000

Creating the csv,excel and sql database and table for storing the above data:

In [60]:
df.to_csv('EmpData.csv',index=False,header=False)

In [61]:
pip install xlsxwriter

Requirement already satisfied: xlsxwriter in /usr/local/lib/python3.6/dist-packages (1.3.7)

In [62]:
Writer=pd.ExcelWriter('EmpData.xlsx',engine='xlsxwriter')
df.to_excel(Writer,sheet_name='sheet1')
Writer.save()

In [63]:
db_filename=r'EmpData.db'
con=lite.connect(db_filename)
df.to_sql('Table1',con,schema=None,if_exists='replace',index=True,index_label=None,chunksize=None,dtype=None)
con.close()

loading and display the data from all these sources into Google colab notebook

In [64]:
location="/content/EmpData.csv"
dfR=pd.read_csv(location,names=['EmpId','FName','LName','Designation','BasicSalary'])
dfR

  EmpId    FName    LName         Designation  BasicSalary
0  E101   Shweta   Subnis     ProjectEngineer        40000
1  E102  Manisha  Perdesi              Tester        50000
2  E103    Madhu     Mali  SrSoftwareEngineer        60000
3  E104    Anita      Rai        WebDeveloper        70000

In [65]:
location="/content/EmpData.xlsx"
dfR=pd.read_excel(location)
dfR

   Unnamed: 0 EmpId    FName    LName         Designation  BasicSalary
0           0  E101   Shweta   Subnis     ProjectEngineer        40000
1           1  E102  Manisha  Perdesi              Tester        50000
2           2  E103    Madhu     Mali  SrSoftwareEngineer        60000
3           3  E104    Anita      Rai        WebDeveloper        70000

In [66]:
from sqlalchemy import create_engine

db_file=r'/content/EmpData.db'
engine=create_engine(r"sqlite:///{}".format(db_file))
sql="Select * from Table1;"
sales_data_df=pd.read_sql(sql,engine)
sales_data_df

   index EmpId    FName    LName         Designation  BasicSalary
0      0  E101   Shweta   Subnis     ProjectEngineer        40000
1      1  E102  Manisha  Perdesi              Tester        50000
2      2  E103    Madhu     Mali  SrSoftwareEngineer        60000
3      3  E104    Anita      Rai        WebDeveloper        70000